[
    {
        "id": 101,
        "title": "LocaGroca (Food)",
        "category": "iOS Development",
        "image": "https://placehold.co/600x400/FF6B6B/FFFFFF?text=LocaGroca",
        "year": "2024",
        "role": "Mobile Engineer",
        "problem": "Generic delivery apps can feel so cold and robotic, and honestly, the code behind them often gets just as messy. I wanted to build something that felt human and welcoming.",
        "approach": "I built this app with a focus on warmth and simplicity. Using SwiftUI, I created smooth, friendly animations that make the app feel alive. Under the hood, I kept things tidy with a clean structure (MVVM) so it's easy to update and keeps working smoothly.",
        "outcome": "A delightful, easy-to-use food app that connects people with local markets, built on code thats as fresh as the produce.",
        "techStack": [
            "Swift",
            "SwiftUI",
            "MVVM",
            "CoreData"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Friendly UI",
            "time": "Active"
        }
    },
    {
        "id": 102,
        "title": "Grocery System",
        "category": "Full-Stack Mobile",
        "image": "https://placehold.co/600x400/4ECDC4/FFFFFF?text=Grocery+App",
        "year": "2024",
        "role": "Full Stack Engineer",
        "problem": "It's super frustrating when you order something online only to find out later it's out of stock. That disconnect between the app and the warehouse is a real pain.",
        "approach": "I connected the mobile app directly to the backend systems so they talk to each other in real-time. By keeping the server environment consistent (using containerization concepts), I made sure that what you see on your phone is exactly what's on the shelf.",
        "outcome": "A reliable shopping experience where inventory is always in sync, so no more disappointing out-of-stock emails.",
        "techStack": [
            "Swift",
            "REST API",
            "Real-time Sync",
            "CI/CD"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Reliable",
            "time": "Active"
        }
    },
    {
        "id": 15,
        "title": "Home Services (MVC)",
        "category": "Software Architecture",
        "image": "/assets/projects/project-15.jpg",
        "year": "2024",
        "role": "Backend Architect",
        "problem": "Ever look at older websites and feel like the code is just a tangled mess of spaghetti? It makes adding new features scary because one small change breaks everything.",
        "approach": "I decided to build my own framework to keep things organized. I separated the data, the logic, and what the user sees into their own lanes. It's like having a tidy filing cabinet instead of a messy desk—everything has its place.",
        "outcome": "A clean, organized system that's easy to maintain and grow, proving that a little structure goes a long way.",
        "techStack": [
            "PHP",
            "MySQL",
            "MVC Pattern",
            "OOP"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Clean Code",
            "time": "Active"
        }
    },
    {
        "id": 10,
        "title": "LibraCore (Library)",
        "category": "Web Development",
        "image": "/assets/projects/project-10.jpg",
        "year": "2024",
        "role": "Frontend Specialist",
        "problem": "Library websites are notorious for being boring and clunky. I wanted to change that perception and make discovering knowledge feel exciting and modern.",
        "approach": "I treated each part of the interface like a building block (component) using React. This keeps the design consistent and the interactions snappy. It's built to be robust, so you don't run into weird glitches while browsing.",
        "outcome": "A 'World of Knowledge' that feels more like a modern app and less like a dusty archive, making learning fun again.",
        "techStack": [
            "TypeScript",
            "React",
            "Component Design",
            "Node.js"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Modern Feel",
            "time": "Active"
        }
    },
    {
        "id": 11,
        "title": "Futuristic Banking",
        "category": "FinTech Engineering",
        "image": "/assets/projects/project-11.jpg",
        "year": "2024",
        "role": "Frontend Architect",
        "problem": "Banking apps are usually safe but boring, or pretty but glitched. I wanted to prove you can have both: a secure vault that looks like a high-end tech product.",
        "approach": "I used a strict 'one-way street' logic for data to make sure your balance is always accurate—no guessing games. key wrapped this rock-solid logic in a sleek, Apple-inspired 3D design to make finance feel premium.",
        "outcome": "A banking platform that you actually enjoy looking at, combining verified security with a top-tier visual experience.",
        "techStack": [
            "TypeScript",
            "React",
            "Immutable State",
            "3D"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Premium UX",
            "time": "Active"
        }
    },
    {
        "id": 103,
        "title": "Resume / Portfolio",
        "category": "DevOps & Web",
        "image": "https://placehold.co/600x400/333333/FFFFFF?text=Portfolio",
        "year": "2024",
        "role": "Software Engineer",
        "problem": "Updating a portfolio shouldn't be a chore. I didn't want to dive into code every time I just wanted to fix a typo or add a new project.",
        "approach": "I built this site to be smart. It reads all my data from a simple file, so I can update my content easily without breaking the site. It's like having a CMS (Content Management System) built right in.",
        "outcome": "A living, breathing website that grows with me, showing that even simple projects deserve smart engineering.",
        "techStack": [
            "JavaScript",
            "JSON",
            "Smart Config",
            "React"
        ],
        "metrics": {
            "price": "Public",
            "quality": "Dynamic",
            "time": "Active"
        }
    },
    {
        "id": 104,
        "title": "Hospital System",
        "category": "Enterprise Solutions",
        "image": "https://placehold.co/600x400/2196F3/FFFFFF?text=Hospital+App",
        "year": "2024",
        "role": ".NET Developer",
        "problem": "Hospital administration is often bogged down by paper trails and disconnected systems, leading to slower patient care.",
        "approach": "I developed a centralized management system using C# and Blazor. I focused on a clean architecture to handle patient records securely and efficiently, ensuring sensitive data is isolated but accessible to authorized personnel.",
        "outcome": "A streamlined platform that reduces administrative overhead and lets healthcare providers focus more on patients.",
        "techStack": [
            "C#",
            "Blazor",
            "SQL Server",
            "Entity Framework"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Secure",
            "time": "Active"
        }
    },
    {
        "id": 105,
        "title": "Grocery Manager",
        "category": "Retail Systems",
        "image": "https://placehold.co/600x400/4CAF50/FFFFFF?text=Grocery+Manager",
        "year": "2024",
        "role": "Backend Engineer",
        "problem": "Managing stock across multiple grocery departments is chaotic without a unified view, leading to waste and lost sales.",
        "approach": "I built a robust inventory tracking application using C# and MVC. It features real-time stock level monitoring and automated alerts for low inventory, all powered by a highly optimized SQL backend.",
        "outcome": "Improved inventory accuracy and operational efficiency, significantly reducing food waste.",
        "techStack": [
            "C#",
            "ASP.NET MVC",
            "LINQ",
            "Bootstrap"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Efficient",
            "time": "Active"
        }
    },
    {
        "id": 106,
        "title": "Booking System",
        "category": "Web Application",
        "image": "https://placehold.co/600x400/9C27B0/FFFFFF?text=Booking+System",
        "year": "2024",
        "role": "Full Stack .NET",
        "problem": " scheduling conflicts are a major headache for service-based businesses, often resulting in double bookings and frustrated clients.",
        "approach": "This ASP.NET Core solution implements a conflict-detection algorithm to ensure zero overlap. I used a code-first approach with Entity Framework to design a flexible database schema that adapts to different service types.",
        "outcome": "A reliable scheduling tool that eliminates booking errors and improves customer trust.",
        "techStack": [
            "C#",
            "ASP.NET Core",
            "REST API",
            "EF Core"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Reliable",
            "time": "Active"
        }
    },
    {
        "id": 107,
        "title": "Library Catalog",
        "category": "Information Systems",
        "image": "https://placehold.co/600x400/FF5722/FFFFFF?text=Library+App",
        "year": "2024",
        "role": ".NET Developer",
        "problem": "Traditional library searches can be slow and unforgiving if you don't know the exact book title.",
        "approach": "I created a smart cataloging system using C# that supports fuzzy search and advanced filtering. The system uses a clean N-Tier architecture to separate the user interface from the complex search logic.",
        "outcome": "Users can find resources instantly, even with partial information, making the library much more accessible.",
        "techStack": [
            "C#",
            "Web Forms",
            "SQL",
            "ADO.NET"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Searchable",
            "time": "Active"
        }
    },
    {
        "id": 108,
        "title": "Virtual Classroom",
        "category": "EdTech",
        "image": "https://placehold.co/600x400/3F51B5/FFFFFF?text=Virtual+Classroom",
        "year": "2024",
        "role": "Software Architect",
        "problem": "Remote learning often feels disconnected, with tools that lack the interactivity of a real classroom.",
        "approach": "I architected a virtual learning environment using ASP.NET. It features real-time assignment tracking and a discussion board, leveraging SignalR for instant communication between students and teachers.",
        "outcome": "A cohesive digital learning space that fosters better engagement and streamlines course management.",
        "techStack": [
            "C#",
            "ASP.NET",
            "SignalR",
            "Razor Pages"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Interactive",
            "time": "Active"
        }
    },
    {
        "id": 109,
        "title": "Snake Game",
        "category": "Game Development",
        "image": "https://placehold.co/600x400/8BC34A/FFFFFF?text=Snake+Game",
        "year": "2024",
        "role": "C# Developer",
        "problem": "Understanding the core mechanics of game loops and object-oriented collision detection is fundamental for any developer, yet often overlooked.",
        "approach": "I built this classic game from the ground up using pure C#. It focuses on memory management and performant logic loops to ensure smooth gameplay without heavy engine overhead.",
        "outcome": "A flawlessly smooth retro gaming experience that demonstrates strong command of core programming algorithms.",
        "techStack": [
            "C#",
            ".NET Framework",
            "Windows Forms",
            "GDI+"
        ],
        "metrics": {
            "price": "Open Source",
            "quality": "Fun",
            "time": "Active"
        }
    }
]