[
    {
        "id": 101,
        "title": "LocaGroca (Food)",
        "category": "iOS Development",
        "image": "https://placehold.co/600x400/FF6B6B/FFFFFF?text=LocaGroca",
        "year": "2024",
        "role": "Mobile Engineer",
        "problem": "Generic delivery apps can feel so cold and robotic, and honestly, the code behind them often gets just as messy. I wanted to build something that felt human and welcoming.",
        "approach": "I built this app with a focus on warmth and simplicity. Using SwiftUI, I created smooth, friendly animations that make the app feel alive. Under the hood, I kept things tidy with a clean structure (MVVM) so it's easy to update and keeps working smoothly.",
        "outcome": "A delightful, easy-to-use food app that connects people with local markets, built on code thats as fresh as the produce.",
        "techStack": [
            "Swift",
            "SwiftUI",
            "MVVM",
            "CoreData"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Friendly UI",
            "time": "Active"
        }
    },
    {
        "id": 102,
        "title": "Grocery System",
        "category": "Full-Stack Mobile",
        "image": "https://placehold.co/600x400/4ECDC4/FFFFFF?text=Grocery+App",
        "year": "2024",
        "role": "Full Stack Engineer",
        "problem": "It's super frustrating when you order something online only to find out later it's out of stock. That disconnect between the app and the warehouse is a real pain.",
        "approach": "I connected the mobile app directly to the backend systems so they talk to each other in real-time. By keeping the server environment consistent (using containerization concepts), I made sure that what you see on your phone is exactly what's on the shelf.",
        "outcome": "A reliable shopping experience where inventory is always in sync, so no more disappointing out-of-stock emails.",
        "techStack": [
            "Swift",
            "REST API",
            "Real-time Sync",
            "CI/CD"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Reliable",
            "time": "Active"
        }
    },
    {
        "id": 15,
        "title": "Home Services (MVC)",
        "category": "Software Architecture",
        "image": "/assets/projects/project-15.jpg",
        "year": "2024",
        "role": "Backend Architect",
        "problem": "Ever look at older websites and feel like the code is just a tangled mess of spaghetti? It makes adding new features scary because one small change breaks everything.",
        "approach": "I decided to build my own framework to keep things organized. I separated the data, the logic, and what the user sees into their own lanes. It's like having a tidy filing cabinet instead of a messy desk—everything has its place.",
        "outcome": "A clean, organized system that's easy to maintain and grow, proving that a little structure goes a long way.",
        "techStack": [
            "PHP",
            "MySQL",
            "MVC Pattern",
            "OOP"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Clean Code",
            "time": "Active"
        }
    },
    {
        "id": 10,
        "title": "LibraCore (Library)",
        "category": "Web Development",
        "image": "/assets/projects/project-10.jpg",
        "year": "2024",
        "role": "Frontend Specialist",
        "problem": "Library websites are notorious for being boring and clunky. I wanted to change that perception and make discovering knowledge feel exciting and modern.",
        "approach": "I treated each part of the interface like a building block (component) using React. This keeps the design consistent and the interactions snappy. It's built to be robust, so you don't run into weird glitches while browsing.",
        "outcome": "A 'World of Knowledge' that feels more like a modern app and less like a dusty archive, making learning fun again.",
        "techStack": [
            "TypeScript",
            "React",
            "Component Design",
            "Node.js"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Modern Feel",
            "time": "Active"
        }
    },
    {
        "id": 11,
        "title": "Futuristic Banking",
        "category": "FinTech Engineering",
        "image": "/assets/projects/project-11.jpg",
        "year": "2024",
        "role": "Frontend Architect",
        "problem": "Banking apps are usually safe but boring, or pretty but glitched. I wanted to prove you can have both: a secure vault that looks like a high-end tech product.",
        "approach": "I used a strict 'one-way street' logic for data to make sure your balance is always accurate—no guessing games. key wrapped this rock-solid logic in a sleek, Apple-inspired 3D design to make finance feel premium.",
        "outcome": "A banking platform that you actually enjoy looking at, combining verified security with a top-tier visual experience.",
        "techStack": [
            "TypeScript",
            "React",
            "Immutable State",
            "3D"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Premium UX",
            "time": "Active"
        }
    },
    {
        "id": 103,
        "title": "Resume / Portfolio",
        "category": "DevOps & Web",
        "image": "https://placehold.co/600x400/333333/FFFFFF?text=Portfolio",
        "year": "2024",
        "role": "Software Engineer",
        "problem": "Updating a portfolio shouldn't be a chore. I didn't want to dive into code every time I just wanted to fix a typo or add a new project.",
        "approach": "I built this site to be smart. It reads all my data from a simple file, so I can update my content easily without breaking the site. It's like having a CMS (Content Management System) built right in.",
        "outcome": "A living, breathing website that grows with me, showing that even simple projects deserve smart engineering.",
        "techStack": [
            "JavaScript",
            "JSON",
            "Smart Config",
            "React"
        ],
        "metrics": {
            "price": "Public",
            "quality": "Dynamic",
            "time": "Active"
        }
    }
]